Revit 2027 API
RebarContainerItem.SetBarHiddenStatus Method
 Sets the bar in this rebar set to be hidden or unhidden in the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBarHiddenStatus(
	View view,
	int barIndex,
	bool hide
)
Public Sub SetBarHiddenStatus (
	view As View,
	barIndex As Integer,
	hide As Boolean
)
public:
void SetBarHiddenStatus(
	View^ view,
	int barIndex,
	bool hide
)
member SetBarHiddenStatus :
        view : View *
        barIndex : int *
        hide : bool -> unit
Parameters
view View
 The view.
barIndex Int32
 The index of the bar from this set.
hide Boolean
 True to hide this bar in the view, false to unhide the bar.
Exceptions
Exception | Condition
ArgumentException |  This rebar cannot have a presentation mode applied for view, as the view is not valid for rebar presentation, or the orientation of the view matches the normal direction of the rebar.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Remarks
 Individual bars of a rebar set can be hidden in a view only if the presentation mode is RebarPresentationMode.Select. If that is not the presentation mode assigned for this set in the view, this method will also change it.
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace